<style lang="scss" scoped>
.page {
  @apply flex flex-row justify-center;
  max-height: 100vh;
  overflow-y: scroll;
  // border: 1px solid red;
  &-wrapper {
    // border: 1px solid red;
    @apply py-9 px-5;
    max-width: 1100px;
    h2 {
      font-size: 60px;
      margin-left: 20px;
    }
    h1 {
      font-size: 100px;
    }
    .cases {
      @apply flex flex-row flex-wrap;
      // border: 1px solid red;
      .case {
        background: url('/images/delimusic.png');
        @apply flex justify-center relative bg-center bg-no-repeat bg-contain;
        // box-shadow: 1px -1px 100px #000;
        border: 1px solid rgb(216, 216, 216);
        border-radius: 30px;
        cursor: pointer;
        width: 260px;
        height: 260px;
        margin: 20px;
        margin-bottom: 70px;
        &:hover {
          transform: scale(1.01)
        }
        h6 {
          @apply absolute;
          font-size: 34px;
          font-weight: 500;
          bottom: -50px;
        }
      }
    }
  }
}
.folder {
  @apply flex flex-row flex-wrap relative;
  background: rgba(0, 0, 0, 0.2);
  border-radius: 30px;
  width: 100%;
  width: 260px;
  // padding: 20px;
  height: 260px;
  margin: 20px;
  margin-bottom: 70px;
  .apps {
    @apply flex flex-row flex-wrap justify-start content-start;
    padding: 20px;
    .app {
      background: rgb(146, 146, 146);
      border-radius: 10px;
      cursor: pointer;
      width: 60px;
      height: 60px;
      margin: 5px;
      &:hover {
        transform: scale(1.1);
      }
    }
  }
}
</style>
<template lang="pug">
  div(ref="page").page
    DialogCase(v-if="openedCase" @close="openCase()" :dialogInfo="dialogInfo")
    .page-wrapper
      h1(style="margin-left: 20px;") Кейсы
      h2 Branding & Strategy
      .cases
        div(
          v-for="(block, caseId) in brandingStrategy"
          :key="caseId"
          @click="openCase(brandingStrategy[caseId])"
          :style="{backgroundImage: `url('/images/cases/${block.img}')`}"
        ).case
          h6 {{block.name}}
      h2 CustDev
      .cases
        div(
          v-for="(block, caseId) in custDev"
          :key="caseId"
          @click="openCase(custDev[caseId])"
          :style="{backgroundImage: `url('/images/cases/${block.img}')`}"
        ).case
          h6 {{block.name}}
      h2 Special Projects
      .cases
        div(
          v-for="(block, caseId) in specialProjects"
          :key="caseId"
          @click="openCase(specialProjects[caseId])"
          :style="{backgroundImage: `url('/images/cases/${block.img}')`}"
        ).case
          h6 {{block.name}}
        .folder
          .apps
            div(v-for="pack in 4").app
</template>
<script>
import DialogCase from '@/components/DialogCase.vue'

export default {
  name: 'Cases',
  components: {
    DialogCase
  },
  data() {
    return {
      dialogInfo: null,
      openedCase: false,
      brandingStrategy: [
        { name: 'Fosci',
          img: 'fosci.png',
          brif: `
            Компания, разработавшая собственную ERP-систему для автоматизации доставок рационов питания,
            обратилась с запросом на репутационный маркетинг. Задача — сделать бренд более живым и узнаваемым,
            найти новые точки соприкосновения с ЦА.
          `,
          creative: `
            Презентовать бренд как эксперта в сферах бизнеса, биохакинга и здорового питания.
          `,
          release: `
            Поменяли нейминг на fosci (food-science). Сформировали актуальное позиционирование и коммуникационную стратегию.
            Обновили логотип и фирменный стиль. Разработали текстовый и визуальный контент для запуска аккаунта в instagram в соотвествии с визуальной концепцией.
            Использовали 3D-иллюстрацию с целью привлечь аудиторию, интересующуюся технологиями.
          `,
          results: `
            Заданный вектор в направлении создания instagram-комьюнити, позволяющего решать свои бизнес-задачи.
            Начальный контент для аккаунта, исчерпывающий все базовые вопросы.
          `
        },
        { name: 'Повод найдется',
          img: 'povod.png',
          brif: `
            Компания Повод найдется обратилась с запросом создать собственную школу флористики и онлайн курс..
          `,
          creative: `
            Создать свободную академию флористов с полноценным профессиональным образованием, для тех, кто мечтает сменить профессию. 
          `,
          release: `
            Разработали бренд-платформу для школы флористики. Создали онлайн курс и дополнительные модульные курсы.
            Разработали брендбук, визуальный контент для аккаунта в instagram и сайта в соответствии с визуальной концепцией.
            Предложили коммуникационную стратегию для школы флористики.
          `,
          results: `
          `
        },
        { name: 'Делисервис',
          img: 'deliservice.png',
          brif: `
            Делисервис - новый старт-ап, мобильное приложение и сайт для получения услуг по 
            обслуживанию авто обратился с запросом создания бренд-платформы и различных special projects.
          `,
          creative: `
            Сохранение визуальной айдентики Делимобиля с привнесением новых деталей для успешного запуска старт-апа на рынок. 
            Научить автомобилистов пользоваться диджитал автосервисами на регулярной основе.
          `,
          release: `
            Разработка пирамиды бренда. Создание коммуникационной стратегии с целью сформировать на старте ядро комьюнити с высоким LTV. 
            Представление фирменного стиля и создание брендбука. Брендирование машин в рамках визуализации брендирования. 
            Создание позиционирования товарной матрицы. Ведение социальных сетей Делисервиса.
          `,
          results: `
          `
        },
      ],
      custDev: [
        { name: 'Sirius',
          img: 'sirius.png',
          brif: `
            Sirius — относительно молодой производитель навесных вентилируемых фасадов.
            Целевая аудитория разнообразна с точки зрения возраста и пользовательских привычек.
            Поступил запрос на качественную коммуникационную стратегию.
          `,
          creative: `
            Прогрессивность превыше консерватизма. Выделить систему Sirius на фоне конкурентов удобством онлайн-коммуникации.
            Взять за основу развитие собственного образовательного журнала со статьями и вебинарами, исключая неэффективные вложения в социальные сети.
          `,
          release: `
            Провели социологическое исследование, выявив новый интересный сегмент ЦА — проектировщиков и их главную боль — недостаток образовательного контента.
            Внедрили новую коммуникационную стратегию, где ключевые слова: прогрессивность, прозрачность, взаимопомощь.
          `,
          results: `
            Начали путь ребрендинга с фирменного стиля. Сотрудничество продолжается
          `
        },
        { name: 'Ampl',
          img: 'ampl.png',
          brif: `
            Ampl - бренд с
            медицинской базой, гарантирующий
            эффективность и поддержку обратился с запросом помощи выхода на рынок и формирования ядра покупателей.
          `,
          creative: `
            Хотим сделать упор на медицинский фактор, ёмко
            и доступно объяснить действие продукта, в том
            числе с медицинской точки зрения. Коммуницировать через дизайн и через приверженность научному подходу в
            тестировании и разработке.
          `,
          release: `
            Реализовали custdev для более детального изучения ЦА. Предложили вариант нейминга. Представили коммуникационную стратегию, 
            опираясь на ценности бренда и желания ЦА. Создали фирменный стиль и собрали всю информацию в брендбук.
          `,
          results: `
            Помогли старт-апу выйти на рынок, создали узнаваемый бренд уходовой косметики, в дизайне которой транслируются ее ценности.
          `
        },
      ],
      specialProjects: [
        { name: 'DELI MUSIC DAY',
          img: 'delimusicday.png',
          brif: `
            Делимобиль — один из сильнейших игроков на рынке каршеринга в России. Летом 2020 команда Дели запустила свежий формат для своих 
            пользователей — драйв-ин фестиваль DELI MUSIC DAY. 
            Наша задача состояла в том, чтобы поддержать мероприятие локальными нано-инфлюинсерами из Екатеринбурга.  
          `,
          creative: `

          `,
          release: `
            Отобрали 15 наиболее ярких и молодых инфлюинсеров, проконтролировали своевременное размещение постов с нативным и эмоциональным упоминанием об ивенте.
          `,
          results: `
            Построили максимальное знание о мероприятии. Простимулировали покупку билета. Обеспечили 
            кросс-конверсию в инсталы приложения Делимобиль.
          `
        },
        { name: 'Делимобиль',
          img: 'deli.png',
          brif: `
            Каршеринг Delimobil обратилась с запросом создания серии видеороликов для привлечения миллениалов как новой аудитории.
          `,
          creative: `
            Внедрение лаконичных антикризисных идей, направленных на развитие адекватного 
            шеринг-комьюнити и формирование положительной репутации.
          `,
          release: `
            Придумали и сняли серию ценностных lifestyle роликов, которые отражают ценности бренда.
            Создание special project "Странные виды транспорта" с целью закрепить 
            каршеринг в сознании пользователей как один из видов транспорта.
          `,
          results: `
            Запустили ролики на различные платформы.
          `
        },
        { name: 'Sixty',
          img: 'sixty.png',
          brif: `
            60-ая Параллель — компания, осуществляющая строительно-ремонтные работы с 1990 года, 
            преимущественно на государственных заказа обратилась с запросом создать качественную 
            бренд-платформу новой ветки бизнеса (частный сектор) для запуска MVP
          `,
          creative: `
            Презентовать бренд как опытную компанию, которая занимается ремонтом и строительством, провести ребрендинг с целью привлечь новую платежеспособную аудиторию.
          `,
          release: `
            Сформировали уникальное торговое предложение. Произвели доработку названия. 
            Представили вектор продвижения вашего бренда, опираясь на сегментирование целевой аудитории. 
            Разработали корпоративную идентификацию для print- и digital-материалов: шрифты, цвета, элементы, стилистику, провели доработку логотипа.
          `,
          results: `
            Создали новый образ компании как компании, которая объединяет современные технологии и ценный опыт.
          `
        },
      ],
    }
  },
  methods: {
    openCase(payload) {
      this.dialogInfo = payload
      this.openedCase = !this.openedCase
    }
  },
  async mounted() {
  }
}
</script>